Repository: jupyter/jupyter
Catalog: docs/source/locale/*/LC_MESSAGES/architecture.po
Languages: es, pt_br

source: Architecture Guides
es: Guías de Arquitectura
pt_br: Guias de arquitetura

source: How IPython and Jupyter Notebook work
es: Cómo funcionan IPython y Jupyter Notebook
pt_br: Como IPython e o Jupyter Notebook funcionam

source: Contents
es: Contenidos
pt_br: Conteúdo

source: Abstract
es: Resumen
pt_br: Abstrato

source: This section focuses on IPython and Jupyter notebook and how they interact. When we discuss ``IPython``, we talk about two fundamental roles:
es: Esta sección se enfoca en IPython, Jupyter notebook, y la interacción entre ellos. Cuando hablamos de ``IPython``, nos referimos a 2 roles fundamentales:
pt_br: Esta seção foca no IPython e no Jupyter notebook e como eles interagem. Quando nos discutimos sobre ``IPython``, nos falamos sobre dois papeis fundamentais:

source: Terminal IPython as the familiar REPL
es: Terminal IPython, la clásica consola REPL
pt_br: Terminal do IPython como o familiar REPL

source: The IPython kernel that provides computation and communication with the frontend interfaces, like the notebook
es: El kernel IPython que provee cómputo y comunicación con las interfaces de usuario, cómo el notebook
pt_br: The IPython kernel que fornece o cálculo e a comunicação com as interfaces de frontend como o notebook

source: Jupyter Notebook and its flexible interface extends the notebook beyond code to visualization, multimedia, collaboration, and more.
es: Jupyter Notebook y su interfaz flexible extiende el notebook más allá del código, hacia la visualización, colaboración, multimedia y más.
pt_br: Jupyter Notebook e a sua interface flexível estende o notebook além do código para visualização, multimídia, colaboração e muito mais

source: When you type ``ipython``, you get the original IPython interface, running in the terminal. It does something like this::
es: Cuando escribes ``ipython``, obtienes la interfaz original de IPython, ejecutándose en la terminal. Hace algo como esto::
pt_br: Quando você digita ``ipython``, você obtém a interface original do IPython, rodando no terminal. É algo como isso::

source: Of course, it's much more complex, because it has to deal with multi-line code, tab completion using :mod:`readline`, magic commands, and so on. But the model is like code example: prompt the user for some code, and when they've entered it, execute it in the same process. This model is often called a :term:`REPL`, or Read-Eval-Print-Loop.
es: Por supuesto esto es mucho más complejo, porque tiene que lidiar con código multilínea, completado de tabulación usando :mod:`readline`, comandos mágicos, etc. Pero el modelo es similiar: pide al usuario el código, y cuando éste lo ha ingresado lo ejecuta en el mismo proceso. Este modelo es usualmente llamado :term:`REPL`, o Read-Eval-Print-Loop.
pt_br: Claro, isso é muito mais complexo, por lidar com muitas linhas de código, preenchimento utilizando :mod:`readline`, comandos mágicos e outros. Mas o modelo é como o exemplo: solicita-se ao usuário algum código e quando ele o insere, é executado no mesmo processo. Esse modelo é frequentemente chamado de `REPL`, ou Ler-Avaliar-Imprimir-Repetir

source: The IPython Kernel
es: El Kernel IPython
pt_br: O IPython Kernel

source: All the other interfaces —- the Notebook, the Qt console, ``ipython console`` in the terminal, and third party interfaces —- use the IPython Kernel. The IPython Kernel is a separate process which is responsible for running user code, and things like computing possible completions. Frontends, like the notebook or the Qt console, communicate with the IPython Kernel using JSON messages sent over `ZeroMQ <http://zeromq.org/>`_ sockets; the protocol used between the frontends and the IPython Kernel is described in :ref:`jupyterclient:messaging`.
es: Todas las otras interfaces —- el Notebook, la consola Qt, ``ipython console`` en la terminal e interfaces de terceras partes —- usan el Kernal IPython. El Kernel IPython es un proceso independiente responsable de la ejecución del código de usuario y cuestiones como el cómputo de posibles autocompletados. Interfaces como el notebook o la consola Qt se comunican con el Kernel IPython usando mensajes JSON enviados a través de `ZeroMQ <http://zeromq.org/>`_ sockets; el protocolo usado entre las interfaces y el Kernel IPython es descripto en :ref:`jupyterclient:messaging`.
pt_br: Todas as outras interfaces --- o Notebook, o console Qt, ``ipython console`` no terminal e interfarces terceiras --- usam o kernel do IPython. O Kernek do IPython é um processo de separação que é responsável por rodar o código do usuário e calcular coisas como os possíveis preenchimentos. Interfaces de frontend como o notebook ou o console Qt, se comunicam com o Kernel IPython utilizando mensagens JSON através do `ZeroMQ <http://zeromq.org/>`_ sockets; o protocolo utilizando entre os frontend e o IPython Kernel está descrito em :ref:`jupyterclient:messaging`.

source: The core execution machinery for the kernel is shared with terminal IPython:
es: La maquinaria central de ejecución del kernel es compartida con la terminal IPython:
pt_br: O mecanismo de execução principal para o kernel é compartilhado com o terminal IPython

source: A kernel process can be connected to more than one frontend simultaneously. In this case, the different frontends will have access to the same variables.
es: Un proceso de kernel puede estar conectado con más de una interfaz simultáneamente. En este caso, las diferentes interfaces tendrán acceso a las mismas variables.
pt_br: Um processo do kernel pode ser conectado com mais de um frontend simultaneamente.Nesse caso, diferentes frontends terão acesso as mesmas variáveis

source: This design was intended to allow easy development of different frontends based on the same kernel, but it also made it possible to support new languages in the same frontends, by developing kernels in those languages, and we are refining IPython to make that more practical.
es: Este diseño fue elegido para permitir el fácil desarrollo de diferentes interfaces basadas en el mismo kernel, pero también hizo posible el soporte de nuevos lenguajes de programación para las mismas interfaces desarrollando kernels en esos lenguajes, y estamos refinando IPython para hacer esta tarea más práctica.
pt_br: Esse design foi desenvolvido para permitir um fácil desenvolvimento de diferentes frontends baseados no mesmo kernel, como também permitiu o suporte a novas linguagens nos mesmos frontends, desenvolvendo kernels nessas linguagens, e estamos refinando IPython para tornar isso mais prático

source: Today, there are two ways to develop a kernel for another language. Wrapper kernels reuse the communications machinery from IPython, and implement only the core execution part. Native kernels implement execution and communications in the target language:
es: En la actualidad hay dos formas de desarrollar un kernel para otro lenguaje. Los wrapper kernels reusan la maquinaria de comunicación desde IPython e implementan sólo la parte de ejecución central. Los kernel nativos implementan ejecución y comunicación en el lenguaje destino.
pt_br: Hoje, existem duas maneiras de desenvolver um kernel para outra linguagem. Wrapper kernels reutilizam o mecanismo de comunicações do IPython, e implementam apenas a parte da execução central. Kernels nativos implementam a execução e a comunicação na linguagem alvo:

source: Wrapper kernels are easier to write quickly for languages that have good Python wrappers, like `octave_kernel <https://pypi.python.org/pypi/octave_kernel>`_, or languages where it's impractical to implement the communications machinery, like `bash_kernel <https://pypi.python.org/pypi/bash_kernel>`_. Native kernels are likely to be better maintained by the community using them, like `IJulia <https://github.com/JuliaLang/IJulia.jl>`_ or `IHaskell <https://github.com/gibiansky/IHaskell>`_.
es: Los wrapper kernels pueden desarrollarse rápido con más facilidad en lenguajes que tienen buenos Python wrappers, como `octave_kernel <https://pypi.python.org/pypi/octave_kernel>`_, o lenguajes donde es poco práctico implementar la maquinaria de comunicación, como `bash_kernel <https://pypi.python.org/pypi/bash_kernel>`_. Los kernels nativos tienen más probabilidades de ser mejor mantenidos por la comunidad que los utiliza, como `IJulia <https://github.com/JuliaLang/IJulia.jl>`_ o `IHaskell <https://github.com/gibiansky/IHaskell>`_.
pt_br: É mais fácil escrever wrapper kernels rapidamente para linguagens que tem bons wrappers Python, como o `octave_kernel <https://pypi.python.org/pypi/octave_kernel>`_, ou linguagens onde não é prático implementar o mecanismo de comunicação, como o `bash_kernel <https://pypi.python.org/pypi/bash_kernel>`_. Kernels nativos tem mais probabilidade de serem mantidos pela comunidade, como o `IJulia <https://github.com/JuliaLang/IJulia.jl>`_ ou o `IHaskell <https://github.com/gibiansky/IHaskell>`_.

source: The Notebook frontend does something extra. In addition to running your code, it stores code and output, together with markdown notes, in an editable document called a notebook. When you save it, this is sent from your browser to the notebook server, which saves it on disk as a JSON file with a ``.ipynb`` extension.
es: La interfaz Notebook hace algo extra. Además de ejecutar tu código, almacena el código y la salida junto a notas de estilo markdown, en un documento editable llamado notebook. Cuando lo guardas, es enviado desde el explorador al servidor notebook, que lo guarda en disco como un archivo JSON con una extensión ``.ipynb``.
pt_br: O frontend do Notebook faz algo extra. Além de rodar o seu código, ele armazena código e resultado, juntamente com notas de remarcação, em um documento editável chamado notebook. Quando você o salva, ele é enviado do seu navegador para o servidor do notebook, que o salva em um disco como um arquivo JSON com extensão ``.ipynb``.

source: The notebook server, not the kernel, is responsible for saving and loading notebooks, so you can edit notebooks even if you don't have the kernel for that language—you just won't be able to run code. The kernel doesn't know anything about the notebook document: it just gets sent cells of code to execute when the user runs them.
es: El servidor notebook, no el kernel, es el responsable por guardar y cargar notebooks, así puedes editar notebooks aún cuando no poseas el kernel for ese lenguaje — simplemente no podrás ejecutar el código. El kernel no conoce nada acerca del documento notebook: sólo recibe celdas de código para ejecutar cuando el usuario las corre.
pt_br: O servidor de notebooks, e não o kernel, é responsável por salvar e carregar notebooks, de modo que você possa editá-los mesmo que você não tenha o kernel para aquela linguagem—você apenas não poderá executar código. O kernel não sabe nada sobre o documento notebook: ele apenas recebe células de código para executar quando o usuário as aciona.

source: Exporting notebooks to other formats
es: Exportando notebooks a otros formatos
pt_br: Exportando notebooks para outros formatos

source: The Nbconvert tool in Jupyter converts notebook files to other formats, such as HTML, LaTeX, or reStructuredText. This conversion goes through a series of steps:
es: La herramienta Nbconvert en Jupyter convierte archivos notebok a otros formatos, como HTML, LaTeX, o reStructuredText. Esta conversión se realiza en una serie de pasos:
pt_br: A ferramenta Nbconvert no Jupyter converte arquivos notebook para outros formatos, como HTML, LaTeX, ou reStructuredText. Esta conversão ocorre através de uma série de passos:

source: Preprocessors modify the notebook in memory. E.g. ExecutePreprocessor runs the code in the notebook and updates the output.
es: Preprocesadores modifican el notebook en la memoria. Ej: ExecutePreprocessor corre el código en el notebook y actualiza la salida.
pt_br: Pré-processadores modificam o notebook na memória. Por exemplo, ExecutePreprocessor executa o código no notebook e atualiza o resultado.

source: An exporter converts the notebook to another file format. Most of the exporters use templates for this.
es: Un exportador convierte el notebook en otro formato de archivo. La mayoría de los exportadores usan plantillas para esto.
pt_br: Um exportador converte o notebook para outro formato de arquivo. A maioria dos exportadores usa templates para esse fim.

source: Postprocessors work on the file produced by exporting.
es: Postprocesadores trabajan en el archivo producido por la exportación.
pt_br: Pós-processadores trabalham no arquivo produzido após a exportação.

source: The `nbviewer <http://nbviewer.jupyter.org/>`_ website uses nbconvert with the HTML exporter. When you give it a URL, it fetches the notebook from that URL, converts it to HTML, and serves that HTML to you.
es: La página web `nbviewer <http://nbviewer.jupyter.org/>`_ usa nbconvert con el exportador HTML. Cuando le das una URL, obtiene la notebook desde esa URL, la convierte en HTML, y la entrega en tu explorador.
pt_br: O site `nbviewer <http://nbviewer.jupyter.org/>`_ utiliza nbconvert com o exportador HTML. Quando você fornece uma URL para ele, ele busca o notebook dessa URL, converte-o para HTML, e mostra esse HTML para você.

source: IPython also includes a parallel computing framework, `IPython.parallel <https://ipyparallel.readthedocs.io/en/latest/>`_. This allows you to control many individual engines, which are an extended version of the IPython kernel described above.
es: IPython también incluye un framework de computación paralela, `IPython.parallel <https://ipyparallel.readthedocs.io/en/latest/>`_. Esto permite al usuario controlar muchos motores individuales, que son una versión extendida del kernel IPython descripto anteriormente.
pt_br: O IPython também inclui uma framework de computação paralela, `IPython.parallel <https://ipyparallel.readthedocs.io/en/latest/>`_. Isso permite que você controle muitos engines individuais, que são uma versão extendida do IPython kernel descrito acima.

source: A Visual Overview of Projects
es: Un resumen visual de los proyectos
pt_br: Uma Visão Geral dos Projetos

source: **A high level visual overview of project relationships**
es: ** Un resumen visual de alto nivel de las relaciones entre proyectos **
pt_br: **Uma visão geral visual de alto nível das relações de projeto**
