Repository: jupyter/jupyter
Catalog: docs/source/locale/*/LC_MESSAGES/community.po
Languages: es

source: All-Jupyter Community Video Call - April 2019
es: Video Conferencia de la Comunidad All-Jupyter - Abril 2019

source: Date: 30 April 2019 at 9am PST (your timezome)
es: Fecha: 30 de Abril 2019, 9am PST

source: Video-conference link: https://calpoly.zoom.us/my/jupyter
es: Enlace video conferencia: https://calpoly.zoom.us/my/jupyter

source: Welcome to the Team Meeting
es: Bienvenidos a la Reunión de Equipo

source: Hello!
es: Hola!

source: The purpose of these monthly video conference calls is to share and demonstrate the awesome things happening in Jupyter community. We invite anyone to present their work, engage in discussion, or just sit in and listen. Whether you have a new lab extension you've created, a new jupyterhub deployment you're excited about, or an nteract papermill pipeline powering your business, we'd love to hear about it! And, we'll record and publish these calls on YouTube for anyone unable to attend.
es: El propósito de estas video conferencias mensuales es compartir y demostrar las cosas asombrosas que suceden en la comunidad Jupyter. Invitamos a todos a presentar su trabajo, participar en las discusiones, o sencillamente escuchar. Ya sea que tengas una nueva extensión de jupyterlab que hayas creado, un despliegue de jupyterhub que te haya emocionado, o un pipeline de nteract papermill potenciando tu negocio, ¡nos encantaría escucharte!

source: For more discussion on the format of these calls, see the thread here.
es: Para mayor discusión en el formato de estas llamadas, lee el hilo aquí.

source: Short reports, celebrations, shout-outs
es: Reportes breves, celebraciones, agradecimientos.

source: This is a place to make short announcements (without a need for discussion). This is also a great place to give shout-outs to contributors! We’ll read through these at the beginning of the meeting.
es: Este es un lugar para hacer anuncios breves (sin la necesidad de una discusión). ¡También es un gran lugar para dar agradecimientos a nuestros contribuidores! Leeremos estos mensajes al principio de la reunión.

source: Agenda Items
es: Ítems de la agenda

source: Add your potential agenda item here 24 hours before the meeting at the latest. We will reorganize the agenda so that it fits in the 60m meeting slot.
es: Agrega tu item potencial a la agenda aquí, 24 horas antes de la reunión a más tardar. Reorganizaremos la agenda para que entre en en el espacio de 60 minutos

source: University of Edinburgh materials and contact:
es: Materiales y contacto de la Universidad de Edinburgo:

source: In Attendance
es: Asisten

source: Name / Institution / Github Handle
es: Nombre / Institución / Cuenta de Github

source: All-Jupyter Community Video Call - March 2019
es: Video Conferencia de la Comunidad All-Jupyter - Marzo 2019

source: Date: 26 March 2019 at 9am PST (your timezome)
es: Fecha: 26 de Marzo 2019, 9am PST

source: Link to prior meeting's virtual meeting report
es: Enlance al reporte de la última reunión virtual

source: Don't get limitted to technical discusions !
es: ¡No se limiten a discusiones técnicas!

source: Name | Institution | Github Handle
es: Nombre | Institución | Cuenta de Github

source: Jupyter Community Call
es: Video Conferencia de la Comunidad Jupyter

source: May 28th, 2019
es: Mayo 28, 2019

source: Date: 28 May 2019 at 9am PST (your timezome)
es: Fecha: 28 de Mayo 2019, 9am PST

source: Link: Youtube Video
es: Enlace: Video de Youtube

source: Welcome to the All-Jupyter Community Meeting
es: Bienvenidos a la Reunión de la Comunidad All-Jupyter

source: If you are joining the All-Jupyter Community video meeting, sign in below so we know who was here. Roll call:
es: Si estás uniendote a la video conferencia de la Comunidad Jupyter, regístrate abajo así sabemos quién eres. Roll call:

source: Purpose
es: Propósito

source: The Jupyter Community Call is an open video call. Think of this as a "monthly, virtual JupyterCon". It's a place for *anyone* to announce and share fun things happening in the Jupyter community. Everyone is welcome (even if you're not presenting). We record these videos and post them on YouTube. For more information, `read this discourse thread <https://discourse.jupyter.org/t/all-jupyter-community-calls/668>`__.
es: La Jupyter Community Call es una video conferencia abierta. Piensa en ella como la "JupyterCon mensual y virtual". Es un lugar para que *cualquiera* anuncie y comparta cosas divertidas que ocurren en la comunidad Jupyter. Todos son bienvenidos (aún si no estás presentando). Grabamos estos videos y los posteamos en YouTube. Para más información `lee este hilo de discourse <https://discourse.jupyter.org/t/all-jupyter-community-calls/668>`__.

source: **Previous Community Calls**
es: ** Community Calls previas **

source: Community Guides
es: Guías de la Comunidad

source: Welcome to the Community Guides for Jupyter. These guides are intended to provide information about the Jupyter community such as background, events, and communication channels. As our community is highly dynamic, information may change, and we will do our best to keep it up to date.
es: Bienvenido a las Guías de la Comunidad para Jupyter. Estas guías tienen la intención de proveer información acerca de la comunidad Jupyter, como los antencedentes, eventos y canales de comunicación. Como nuestra comunidad es muy dinámica, la información puede cambiar, y haremos lo mejor posible para mantenerla al día.

source: Monthly Meetings
es: Reuniones Mensuales

source: The core developers of various Jupyter sub-projects have regular meetings to discuss and demo what they have been working on, discuss future plans, and bootstrap conversation. These meetings are public and you are welcome to join remotely.
es: Los desarrolladores core de varios subproyectos Jupyter tienen reuniones regulares para discutir y presentar en qué han estado trabajando, discutir planes futuros, e iniciar conversaciones. Estas reuniones son públicas y eres bienvenido a unirte remotamente.

source: Each team has their own processes around logistics and planning for the team meetings. The following pages should help you find the information for each.
es: Cada equipo tiene sus propios procesos acerca de la logística y el planeamiento de las reuniones de equipo. Las siguientes páginas deberían ayudarte a encontrar la información para cada una.

source: **All-Jupyter Community Calls** happen on the last Tuesday of every month, and are focused around demonstrations and sharing information across all of the Jupyter projects.
es: ** All-Jupyter Community Calls **. Se realizan el último Martes de cada mes, y están enfocadas en realizar demostraciones y compartir información de todos los proyectos de Jupyter.

source: Find information on `this Discourse thread <https://discourse.jupyter.org/t/all-jupyter-community-calls/668>`_.
es: Encuentra información en `este hilo de Discourse <https://discourse.jupyter.org/t/all-jupyter-community-calls/668>`_.

source: Watch previous calls on `our YouTube channel <https://www.youtube.com/playlist?list=PLUrHeD2K9Cmkoamm4NjLmvXC4Y6E1o8SP>`_.
es: Mira reuniones previas en `nuestro canal de YouTube <https://www.youtube.com/playlist?list=PLUrHeD2K9Cmkoamm4NjLmvXC4Y6E1o8SP>`_.

source: Read the `notes from previous calls <community-call-notes/index.html>`_.
es: Lee las `notas de calls previas <community-call-notes/index.html>`_.

source: **JupyterHub meetings** happen monthly. For a calendar of future team meetings, see `the JupyterHub team compass repository <https://jupyterhub-team-compass.readthedocs.io/en/latest/meetings.html>`_.
es: **Reuniones de JupyterHub** . Se realizan mensualmente. Para ver el calendario de reuniones futuras, ve al `repositorio compass del equipo JupyterHub <https://jupyterhub-team-compass.readthedocs.io/en/latest/meetings.html>`_.

source: **JupyterLab meetings** happen weekly. For more information about when these meetings happen, as well as notes from each meeting, see `the JupyterLab README <https://github.com/jupyterlab/jupyterlab#weekly-dev-meeting>`_.
es: ** Reuniones JupyterLab **. Se realizan semanalmente. Para más información acerca de cuando ocurren éstas reuniones y notas de cada una de ellas, ve al `README de JupyterLab <https://github.com/jupyterlab/jupyterlab#weekly-dev-meeting>`_.

source: **General meeting conversation and planning** often happens in the `dev-meeting-attendance Gitter channel <https://gitter.im/jupyter/dev-meeting-attendance>`_. We recommend checking it periodically for new information about when meetings are happening.
es: ** Reunión General de conversación y planeamiento **. Usualmente se realiza en el ` canal de Gitter dev-meeting-attendance <https://gitter.im/jupyter/dev-meeting-attendance>`_

source: Jupyter communications
es: Comunicaciones Jupyter

source: As a general rule, most project-wide conversation happens in the `Jupyter community forum <https://discourse.jupyter.org>`_. There are also many other kinds of communication that happens within the community. See below for links and other relevant information.
es: Como regla general, la mayoría de las conversaciones de proyecto suceden en el `foro de la comunidad Jupyter<https://discourse.jupyter.org>`_. También hay muchas otras formas de comunicación que ocurren dentro de la comunidad. Mira los enlances a continuación para obtener información relevante.

source: Community forum `<https://discourse.jupyter.org/>`_
es: Foro de la comunidad `<https://discourse.jupyter.org/>`_

source: Website `<https://jupyter.org>`_
es: Sitio Web `<https://jupyter.org>`_

source: Governance
es: Gobernancia

source: Steering council: Information about the steering council and its members can be found on the `Jupyter website <https://jupyter.org>`_.
es: Consejo directivo: La información acerca del concejo directivo y sus miembros puede ser encontrada en el `sitio web de Jupyter <https://jupyter.org>`_.

source: Jupyter Enhancement Proposal (JEP) process: Details about the process can be found in the `jupyter/enhancement-proposals GitHub repo <https://github.com/jupyter/enhancement-proposals>`_.
es: Proceso Jupyter Enhancement Proposal (JEP): Detalles acerca del proceso pueden encontrarse en el `repositorio GitHub jupyter/enhancement-proposals <https://github.com/jupyter/enhancement-proposals>`_.

source: Code of conduct
es: Código de Conducta

source: Information can be found in the `Jupyter Governance repo on GitHub <https://github.com/jupyter/governance>`_.
es: Puede encontrarse información en el `repositorio GitHub de Gobernancia Jupyter <https://github.com/jupyter/governance>`_.

source: What is a Jovyan?
es: ¿Qué es Jovyan?

source: You may see the word **Jovyan** used in Jupyter tools (such as the user ID in the `Jupyter Docker stacks <https://github.com/jupyter/docker-stacks?`_ or referenced in conversations. But what is a Jovyan?
es: Puede que veas la palabra **Jovyan** usada en herramientas Jupyter (como el ID de usuario en `Jupyter Docker stacks <https://github.com/jupyter/docker-stacks?`_ ) o referenciada en conversaciones. Pero, ¿Qué es Jovyan?

source: In astronomical terms, the word "Jovian" means "like Jupiter". It describes `several planets that share Jupyter-like properties <https://www.universetoday.com/33061/what-are-the-jovian-planets/>`_.
es: En términos astronómicos, la palabra "Jovian" significa "cómo Júpiter". Describe a `múltiples planetas que comparten propiedades parecidas a las de Júpiter <https://www.universetoday.com/33061/what-are-the-jovian-planets/>`_.

source: Much like the planet Jupiter and our solar system, the Jupyter community is large, distributed, and nebulous. We like to use the word **Jovyan** to describe members of this community. Jovyans are fellow open enthusiasts that use, develop, promote, teach, learn, and otherwise enjoy tools in Jupyter's orbit. They make up the Jupyter community. If you're not sure whether you're a Jovyan, you probably are :-)
es: Así como el planeta Júpiter y nuestros sistema solar, la comunidad Jupyter es grande, distribuida, y nebulosa. Nos gusta usar la palabra **Jovyan** para describir miembros de esta comunidad. Jovyans son compañeros entusiastas que usan, desarrollan, promueven, enseñan, aprenden o disfrutan de las herramientas en la órbita de Jupyter. Ellos conforman la comunidad Jupyter. Si no estás seguro si eres un Jovyan, probablemente lo eres :-)
