Repository: jupyter/jupyter
Catalog: docs/source/locale/*/LC_MESSAGES/contents.po
Languages: es, pt_br

source: Project Jupyter and IPython
es: Proyecto Jupyter y IPython
pt_br: Projeto Jupyter e IPython

source: **Table of Contents**
es: **Tabla de Contenidos**
pt_br: **Índice**

source: Indices and tables
es: Indices y tablas
pt_br: Índices e tabelas

source: :ref:`glossary`
es: :ref:`glossario`

source: :ref:`search`
es: :ref:`busqueda`

source: **Resources:**
es: **Recursos:**
pt_br: **Recursos:**

source: Site
es: Sitio

source: Description
es: Descripción
pt_br: Descrição

source: `Jupyter website <https://jupyter.org>`_
es: `Sitio web de Jupyter <https://jupyter.org>`_

source: Keep up to date on Jupyter
es: Mantente al día con Jupyter
pt_br: Como se atualizar sobre o Jupyter

source: `IPython website <https://ipython.org>`_
es: `Sitio web de IPython <https://ipython.org>`_

source: Learn more about IPython
es: Aprende más acerca de IPython
pt_br: Aprenda mais sobre o IPython

source: `jupyter/help repo <https://github.com/jupyter/help>`_
es: `jupyter/ayuda repo <https://github.com/jupyter/help>`_
pt_br: `repositório de ajuda jupyter/help <https://github.com/jupyter/help>`_

source: Start here for help and support questions
es: Empieza aquí para ayuda y preguntas de soporte
pt_br: Comece aqui para obter ajuda e suporte

source: `Jupyter mailing list <https://groups.google.com/forum/#!forum/jupyter>`_
es: `Lista de correos de Jupyter <https://groups.google.com/forum/#!forum/jupyter>`_
pt_br: `lista de discussões do Jupyter <https://groups.google.com/forum/#!forum/jupyter>`_

source: General discussion of Jupyter's use
es: Discusión general de Jupyter's usa
pt_br: Discussões gerais sobre o uso do Jupyter

source: `Jupyter in Education group <https://groups.google.com/forum/#!forum/jupyter-education>`_
es: `Grupo de Jupyter en la Educación <https://groups.google.com/forum/#!forum/jupyter-education>`_
pt_br: `Jupyter em grupos de Educação <https://groups.google.com/forum/#!forum/jupyter-education>`_

source: Discussion of Jupyter's use in education
es: Discusión de los usos de Jupyter en educación
pt_br: Discussão sobre o uso de Jupyter para educação

source: Promotes world-class, innovative, open source scientific software
es: Promueve software científico de clase mundial, innovativo y de código abierto
pt_br: Promove software científico de código aberto, inovador e de classe mundial

source: `Donate to Project Jupyter <https://jupyter.org/donate.html>`_
es: `Dona al Proyecto Jupyter <https://jupyter.org/donate.html>`_
pt_br: `Doe para o Projeto Jupyter <https://jupyter.org/donate.html>`_

source: Please contribute to open science collaboration and sustainability
es: Por favor contribuye a la colaboración y sustentabilidad de la ciencia abierta
pt_br: Por favor contribua para ciência aberta colaborativa e sustentável
