Repository: jupyter/jupyter
Catalog: docs/source/locale/*/LC_MESSAGES/contributor.po
Languages: pt_br

source: Contributor Guides
pt_br: Guias do Colaborador

source: Whether you are a new, returning, or current contributor to Project Jupyter's subprojects or IPython, **we welcome you**.
pt_br: Seja você um colaborador novo, antigo ou atual dos subprojetos do Projeto Jupyter ou do IPython, ** lhe damos as boas-vindas **.

source: Project Jupyter has seen steady growth over the past several years, and it is wonderful to see the many ways people are using these projects. As a result of this rapid expansion, our project maintainers are balancing many requirements, needs, and resources. We ask contributors to take some time to become familiar with our contribution guides and spend some time learning about our project communication and workflow.
pt_br: O Projeto Jupyter tem visto um crescimento constante nos últimos anos e é maravilhoso ver as várias maneiras pelas quais as pessoas estão usando esses projetos. Como resultado dessa rápida expansão, nossos mantenedores dos projetos estão equilibrando muitos requisitos, necessidades e recursos. Pedimos aos colaboradores que tirem um tempo para se familiarizarem com nossos guias de contribuição e passem algum tempo aprendendo sobre a comunicação e o fluxo de trabalho do projeto.

source: The Contributor Guides and individual project documentation offer guidance. If you have a question, please ask us. `Community Resources <https://jupyter.org/community.html>`_ provides information on our commonly used communication methods.
pt_br: Os Guias do Colaborador e a documentação individual do projeto oferecem a orientação necessária. Se você tiver alguma dúvida, pergunte-nos. 'Community Resources <https://jupyter.org/community.html>' _ fornece informações sobre nossos métodos de comunicação comumente usados.

source: We are very pleased to have you as a contributor, and we hope you will find valuable your impact on the projects. **Thank you** for sharing your interests, ideas, and skills with us.
pt_br: Estamos muito satisfeitos por tê-lo como colaborador e esperamos que você ache valioso o seu impacto nos projetos. ** Obrigado ** por compartilhar seus interesses, idéias e habilidades conosco.

source: Do I really have something to contribute to Jupyter?
pt_br: Eu realmente tenho algo para contribuir com o Jupyter?

source: Absolutely ✅. There are always ways to contribute to this community! Whether it is is contributing code, improving documentation and communications, teaching others, or participating in conversations in the community, we welcome and value your contribution!
pt_br: Absolutamente ✅. Sempre há maneiras de contribuir com essa comunidade! Seja contribuindo com código, melhorando a documentação e as comunicações, ensinando outras pessoas ou participando de conversas na comunidade, agradecemos e valorizamos sua contribuição!

source: What kinds of contributions can I make?
pt_br: Quais os tipos de contribuição que posso fazer?

source: The following sections try to provide inspirations for different ways that you can contribute to the Jupyter ecosystem. They're non-complete - if you can think up any way to make an improvement, we appreciate it!
pt_br: As seções a seguir tentam fornecer inspirações para diferentes maneiras de contribuir com o ecossistema Jupyter. Elas não estão completas - se você puder pensar em alguma maneira de melhora-las, agradecemos!

source: Improving documentation
pt_br: Melhorando a documentação

source: One of the most important parts of the Jupyter ecosystem is its documentation. Good documentation makes it easier for users to learn how to use the tools. It also makes it easier to teach others, and to maintain and improve the code itself. There are many ways to improve documentation, such as **reading tutorials and reporting confusing parts**, **finding type-os and minor errors in docs**, **writing your own guides and tutorials**, **improving docstrings within the code**, and **improving documentation style and design**.
pt_br: Uma das partes mais importantes do ecossistema Jupyter é a documentação. Uma boa documentação facilita o aprendizado dos usuários em aprender como utilizar as ferramentas. Também facilita ensinar aos outros e manter e melhorar o próprio código. Existem várias maneiras de melhorar a documentação, como ** ler tutoriais e relatar partes confusas **, ** encontrar type-os e pequenos erros nos documentos **, ** escrever seus próprios guias e tutoriais **, ** melhorar as instruções dentro do código ** e ** aprimorando o estilo e o design da documentação **.

source: If you'd like to improve documentation in the Jupyter community, check out the :ref:`documentation-guide`.
pt_br: Se você deseja melhorar a documentação na comunidade Jupyter, consulte o: ref: 'documentation-guide'.

source: Improving code
pt_br: Melhorando o código

source: There are many different codebases that make up the tools in the Jupyter ecosystem. These are split across many repositories in several GitHub organizations. They cover many different parts of interactive computing, such as **user interfaces**, **kernels**, **shared infrastructure**, **interactive widgets**, or **structured documents**.
pt_br: Existem muitas bases de código diferentes que compõem as ferramentas no ecossistema Jupyter. Elas estão divididas em vários repositórios em diversas organizações no GitHub. Elas abrangem muitas partes diferentes da computação interativa, como ** interfaces de usuário **, ** kernels **, ** infraestrutura compartilhada **, ** widgets interativos ** ou ** documentos estruturados **.

source: We recommend checking out the :ref:`developer-guide` for more information about how you can find the right project to contribute to, and where to go next.
pt_br: Recomendamos consultar o: ref: 'developer-guide' para obter mais informações sobre como encontrar o projeto certo para contribuir e para onde ir.

source: Participating in the community
pt_br: Participando na comunidade

source: The most important part of Jupyter is its community - this is a large and diverse group of people spread across the globe. One of the best ways to contribute to Jupyter is to simply be a positive and helpful member of this community. Whether it **participating in online conversations**, **offering to help others**, **coming to community meetings**, or **teaching others about Jupyter**, there are many ways to improve the Jupyter community. For more information about this, we recommend starting with the :ref:`community-guide`.
pt_br: A parte mais importante do Jupyter é sua comunidade - este é um grupo grande e diversificado de pessoas espalhadas pelo mundo. Uma das melhores maneiras de contribuir para o Jupyter é simplesmente ser um membro positivo e útil nesta comunidade. Seja ** participando de conversas on-line **, ** oferecendo ajuda a outras pessoas **, ** participando de reuniões da comunidade ** ou ** ensinando outras pessoas sobre o Jupyter **, existem muitas maneiras de melhorar a comunidade Jupyter. Para mais informações sobre isso, recomendamos começar com: ref: ' community-guide'.

source: Communications Guide
pt_br: Guia de Comunicações

source: Contents
pt_br: Conteúdo

source: We publish our blog at `<https://blog.jupyter.org>`_. We welcome ideas for posts or guest posts to the Jupyter blog. If you have a suggestion for a future post, please feel free to share your idea with us. We would like to discuss the idea with you.
pt_br: Publicamos nosso blog em '<https://blog.jupyter.org>' _. Estamos abertos para idéias de posts ou posts de convidados no blog do Jupyter. Se você tiver uma sugestão para uma publicação futura, sinta-se à vontade para compartilhar sua ideia conosco. Gostaríamos de discutir a ideia com você.

source: Do you enjoy writing? Please contact us about becoming a guest blogger. We can help guide you through the process of creating a post.
pt_br: Você gosta de escrever? Entre em contato conosco para se tornar um blogueiro convidado. Podemos ajudá-lo no processo de criação de uma postagem.

source: Technical overview
pt_br: Visão técnica geral

source: Jupyter's blog uses the Ghost blog platform for its contributor flexibility and ease of use. Jupyter's blog is deployed at `<https://blog.jupyter.org>`_.
pt_br: O blog de Jupyter usa a plataforma de blogs Ghost para oferecer flexibilidade e facilidade de uso de contribuintes. O blog de Jupyter é implantado em '<https://blog.jupyter.org>' _.

source: Basic workflow from blog idea to published post
pt_br: Fluxo de trabalho básico da ideia do blog até a publicação do post.

source: There are several major steps in the workflow from blog idea to a published post including:
pt_br: Existem várias etapas principais no fluxo de trabalho, desde a ideia do blog até uma postagem publicada, incluindo:

source: Be inspired to write a post
pt_br: Se inspire a escrever um post

source: Send us a message on the Jupyter mailing list and ask us for an author account on our blog
pt_br: Envie-nos uma mensagem na lista de discussão Jupyter e solicite uma conta de autor em nosso blog

source: Creating a draft
pt_br: Criando um rascunho

source: Draft Review
pt_br: Revisão preliminar

source: Editorial acceptance
pt_br: Aceitação dos editores

source: Publishing the post
pt_br: Publicando o post

source: We'll cover each of these as well as how to update a post once it has been published.
pt_br: Abordaremos cada uma delas e também como atualizar uma postagem depois que ela for publicada.

source: Title and metadata
pt_br: Título e metadata

source: Alway check in the metadata fields that a blog post has a title and a canonical URL. It is possible to put the date in the canonical URL, in particular for events like jupyter-day, that can occur several times. The date of the event can differ from the date of the blog post.
pt_br: Sempre verifique nos campos de metadados se a postagem do blog tem um título e um URL canônico. É possível colocar a data na URL canônico, em particular para eventos como o dia dos namorados, que podem ocorrer várias vezes. A data do evento pode ser diferente da data da postagem do blog.

source: Once a post is published, **never** change the post's title or the url. These changes will break links of tweets and RSS feeds that have already referenced the existing, published URL. Keep in mind that when publishing some platforms cache the url immediately; as a result changing the title will direct people to a 404 page.
pt_br: Depois que uma postagem é publicada, ** nunca ** altere o título ou a URL da postagem. Essas alterações quebrarão os links de tweets e feeds RSS que já fizeram referência a URL publicada existente. Lembre-se de que, ao publicar algumas plataformas fazem o cache da url imediatamente; Como resultado, a alteração do título direcionará as pessoas para uma página 404.

source: Title and metadata can always be refined after the actual content of the blog is written, but should not be changed after publication. As a guest you do not have to worry about metadata, the editor or admins will take care of that.
pt_br: O título e os metadados sempre podem ser refinados após a criação do conteúdo real do blog, mas não devem ser alterados após a publicação. Como convidado, você não precisa se preocupar com metadados, o editor ou os administradores cuidarão disso.

source: Working with images
pt_br: Trabalhando com imagens

source: Try not to link to external images. If you want to put an image in the post, insert ``![]()`` in the editor view and drag and drop an image from your desktop into the newly created field in the preview. External images can change, and can break the blog post if they are taken down. This cannot append if you drag and drop images. Moreover, these images will be served from the same CDN (Content Delivery Network) as the blog, which will insure the best overall experience for our readers.
pt_br: Tente não vincular a imagens externas. Se você quiser colocar uma imagem na postagem, insira "! [] ()" na visualização do editor e arraste e solte uma imagem da área de trabalho no campo recém-criado na visualização. Imagens externas podem mudar e podem quebrar a postagem do blog se forem retiradas. Isso não pode acontecer se você arrastar e soltar imagens. Além disso, essas imagens serão veiculadas na mesma CDN (Rede de distribuição de conteúdo) do blog, que garantirá a melhor experiência geral para nossos leitores.

source: The featured image you see at the top of a blog posts is set from within the metadata field, not using the `![]()`. The featured image is treated differently than inlined images by many feedreaders (especially on mobile) and allows a user on a slow connection to read the content of the blog earlier, which is a much better experience for the user than waiting for the featured image to render.
pt_br: A imagem em destaque que você vê na parte superior das postagens do blog é definida no campo de metadados, sem usar o '! [] ()'. A imagem em destaque é tratada de maneira diferente das imagens embutidas por muitos leitores de feeds (especialmente no celular) e permite que um usuário em uma conexão lenta leia o conteúdo do blog mais cedo, o que é uma experiência muito melhor para o usuário do que esperar a imagem em destaque carregar.

source: Do not use minified links when possible. The multiple redirects of minified links degrades the mobile browsing experience. If you need analytics of the number of page views, this information is tracked by Google Analytics.
pt_br: Não use links minificados quando possível. Os vários redirecionamentos de links minificados prejudicam a experiência de navegação móvel. Se você precisar de análises do número de visualizações de página, essas informações serão rastreadas pelo Google Analytics.

source: Draft review
pt_br: Revisão preliminar

source: Ask for a review
pt_br: Peça por uma revisão

source: Once you think you are done, ask someone else to reread your post, and check the various parameters that you might have forgotten before publishing. You are not on your own, this is teamwork, we are here to help you. If we do things in a hurry you will probably spend more time fixing mistakes that actually doing things right in a first place.
pt_br: Depois de concluir, peça a alguém para reler sua postagem e verificar os vários parâmetros que você pode ter esquecido antes de fazer a publicação. Você não está por conta própria, isso é um trabalho em equipe, estamos aqui para ajudá-lo. Se fizermos as coisas com pressa, você provavelmente gastará mais tempo corrigindo erros do que realmente fazendo as coisas certas em primeiro lugar.

source: Usually an editor or admin will take care of publishing the post. The task of the Editor/Admin is to check all metadata are correctly set, that no external images are used, as well as all other quality check describe before.
pt_br: Normalmente, um editor ou administrador se encarrega de publicar a postagem. A tarefa do Editor / Administrador é verificar se todos os metadados estão definidos corretamente, se nenhuma imagem externa é usada e todas as outras verificações de qualidade descritas anteriormente.

source: It is then just a matter of making th post visible to everyone.
pt_br: É apenas uma questão de tornar a postagem visível para todos.

source: Changing an existing post
pt_br: Alterando um post existente

source: Posts Updates
pt_br: Atualização de posts

source: Blog subscribers may receive notification at every update. So use updates and fixes parsimoniously. It is OK to wait a few hours to fix a typo.
pt_br: Os assinantes do blog podem receber notificações a cada atualização. Portanto, use atualizações e correções com parcimônia. Não há problema em esperar algumas horas para corrigir um erro de digitação.

source: If some substantial updates have to be made, like change of location, time etc, please insert an `[Update]` section at top (or bottom of the blog post depending on importance) with the Date/Time of the update. If the information in the body of the blog is wrong, try not to replace it, and just use strike-through to mark it as obsolete. This would help reader determine which information is correct when dealing with multiple source giving different informations.
pt_br: Se algumas atualizações substanciais tiverem que ser feitas, como mudança de local, horário etc., insira uma seção '[Update]' na parte superior (ou inferior da postagem do blog, dependendo da importância) com a Data / Hora da atualização. Se as informações no corpo do blog estiverem incorretas, tente não substituí-las e use as instruções para marcá-las como obsoletas. Isso ajudará o leitor a determinar quais informações estão corretas ao lidar com várias fontes que fornecem informações diferentes.

source: Documentation in progress.
pt_br: Documentação em andamento.
