Repository: jupyter/jupyter
Catalog: docs/source/locale/*/LC_MESSAGES/glossary.po
Languages: pt_br

source: Glossary
pt_br: Glossário

source: command line
pt_br: linha de comando

source: The terminal or console window where you type commands.
pt_br: A janela do terminal ou console onde você digita os comandos.

source: Command Prompt
pt_br: Prompt de Comando

source: On Windows, this is the application where commands are typed into a window for execution.
pt_br: No Windows, este é o aplicativo em que os comandos são digitados em uma janela para execução.

source: The package manager for Anaconda.
pt_br: O gerenciador de pacotes do Anaconda.

source: Refers to the configuration files and process.
pt_br: Refere-se aos arquivos e processos de configuração.

source: A kernel provides programming language support in Jupyter. IPython is the default kernel. Additional kernels include R, Julia, and many more.
pt_br: Um kernel fornece suporte à linguagem de programação no Jupyter. IPython é o kernel padrão. Kernels adicionais incluem R, Julia e muitos outros.

source: Notebook Dashboard
pt_br: Dashboard do Notebook

source: The notebook user interface which shows a list of the notebooks, files, and subdirectories in the directory where the notebook server is started.
pt_br: A interface do usuário do notebook, que mostra uma lista dos notebooks, arquivos e subdiretórios no diretório em que o servidor notebook foi iniciado.

source: Python package manager.
pt_br: O gerenciador de pacotes do Python

source: Not available in Jupyter. In IPython 3, profiles are collections of configuration and runtime files.
pt_br: Não disponível no Jupyter. No IPython 3, profiles são coleções de arquivos de configuração e arquivos de runtime.

source: read-eval-print-loop.
pt_br: leitura-avaliação-impressão-ciclo.

source: A window used to type in commands to be executed (Linux and OS X).
pt_br: Uma janela usada para digitar comandos a serem executados (Linux e OS X).

source: A user interface component, similar to a plugin, that allows customized input, such as a slider.
pt_br: Um componente da interface do usuário, semelhante a um plug-in, que permite entrada personalizada, como por exemplo um slider.
