Repository: jupyter/jupyter
Catalog: docs/source/locale/*/LC_MESSAGES/install-kernel.po
Languages: es

source: *Optional:* Installing Kernels
es: *Opcional:* Instalar los Kernels

source: Contents
es: Contenidos

source: This information gives a high-level view of using Jupyter Notebook with different programming languages (kernels).
es: Esta información le da un alto nivel de visualización a utilizar Jupyter Notebook con diferentes lenguajes de programación (kernels).

source: Are any languages pre-installed?
es: Hay algún lenguaje preinstalado?

source: Yes, installing the Jupyter Notebook will also install the `IPython <https://ipython.readthedocs.io/en/latest/>`_ :term:`kernel`. This allows working on notebooks using the Python programming language.
es: Si, instalando Jupyter Notebook también instalará `IPython <https://ipython.readthedocs.io/en/latest/>`_ :term:`kernel`. Esto permite trabajar con notebooks usando el lenguaje de programación Python.

source: How do I install Python 2 and Python 3?
es: Cómo instalo Python 2 y Python 3?

source: To install an additional version of Python, i.e. to have both Python 2 and 3 available, see the IPython docs on `installing kernels <https://ipython.readthedocs.io/en/latest/install/kernel_install.html>`_.
es: Para instalar una versión adicional de Python, es decir, tener Python 2 y Python 3 disponibles, vea la documentación de IPython en `installing kernels <https://ipython.readthedocs.io/en/latest/install/kernel_install.html>`_.

source: How do I install other languages like R or Julia?
es: Cómo instalo otros lenguajes como R o Julia?

source: To run notebooks in languages other than Python, such as R or Julia, you will need to install additional kernels. For more information, see the full `list of available kernels`_.
es: Para ejecutar notebooks en lenguajes diferentes de Python, Cómo R o Julia, Debes instalar kernels adicionales. Para más información, vea la lista completa `lista de kernels disponibles`_.

source: :ref:`Jupyter Projects <subprojects>`
es: :ref:`Proyectos de Jupyter <subprojects>`

source: Detailed installation instructions for individual Jupyter or IPython projects.
es: Instrucciones detalladas de instalación para proyectos individuales de Jupyter o IPython.

source: Information about additional programming language kernels.
es: Información acerca de kernels de lenguajes de programación adicionales.

source: :ref:`Kernels documentation for Jupyter client <kernels>`
es: :ref:`Documentación de Kernels para un cliente de Jupyter <kernels>`

source: Technical information about kernels.
es: Información técnica acerca de kernels.
