Repository: jupyter/jupyter
Catalog: docs/source/locale/*/LC_MESSAGES/ipython.po
Languages: es

source: Contents
es: Contenidos

source: Description
es: Descripción

source: IPython provides a rich architecture for interactive computing with:
es: IPython provee una rica arquitectura para computación interactiva con:

source: A powerful interactive shell.
es: Una poderosa shell interactiva.

source: A kernel for Jupyter.
es: Un kernel para Jupyter.

source: Support for interactive data visualization and use of GUI toolkits.
es: Soporte para visualización de datos interactiva y uso del paquete de herramientas GUI.

source: Flexible, embeddable interpreters to load into your own projects.
es: Interpretes flexibles, incorporables para incluir en tus propios proyectos.

source: Easy to use, high performance tools for parallel computing.
es: Herramientas de alto rendimiento y fácil de usar, para cómputo paralelo.

source: Background
es: Antecedentes

source: IPython is a growing project, with increasingly language-agnostic components. IPython 3.x was the last monolithic release of IPython, containing the notebook server, qtconsole, etc. As of IPython 4.0, the language-agnostic parts of the project: the notebook format, message protocol, qtconsole, notebook web application, etc. have moved to new projects under the name Jupyter. IPython itself is focused on interactive Python, part of which is providing a Python kernel for Jupyter.
es: IPython es un proyecto en crecimiento, con una cantidad de componentes agnósticos de lenguaje en incremento. IPython 3.x fue el último lanzamiento monolítico de IPython, conteniendo el notebook server, la qtconsole, etc. Para IPython 4.0, las partes de lenguaje agnóstico del proyecto: el formato del notebook, protocolo de mensajes, qtconsole, aplicación web de notebook, etc. Se han movido a nuevos proyectos bajo el nombre de Jupyter. IPython en si mismo está enfocado en Python interactivo, parte de ello es proveer un kernel Python para Jupyter.

source: Resources
es: Recursos
