Repository: jupyter/jupyter
Catalog: docs/source/locale/*/LC_MESSAGES/running.po
Languages: pt_br

source: Running the Notebook
pt_br: Executando o Notebook

source: Contents
pt_br: Conteúdo

source: Basic Steps
pt_br: Primeiros passos

source: Start the notebook server from the :term:`command line`::
pt_br: Inicie o servidor do notebook a partir da :term:`linha de comando`::

source: You should see the notebook open in your browser.
pt_br: Você verá o notebook sendo aberto em uma aba do seu navegador padrão.

source: Starting the Notebook Server
pt_br: Iniciando o Servidor do Notebook

source: After you have installed the Jupyter Notebook on your computer, you are ready to run the notebook server. You can start the notebook server from the :term:`command line` (using :term:`Terminal` on Mac/Linux, :term:`Command Prompt` on Windows) by running::
pt_br: Após a instalação do Jupyter Notebook no seu computador, você está pronto para executar o servidor do notebook. Você pode iniciar o servidor através da :term:`linha de comando`:: (utilizando o :term:`Terminal`:: no Mac/Linux, :term:`Prompt de Comando`:: no Windows) executando:

source: This will print some information about the notebook server in your terminal, including the URL of the web application (by default, ``http://localhost:8888``):
pt_br: Isso irá exibir algumas informações sobre o servidor do notebook no seu terminal, incluindo a URL da aplicação web (por padrão, ``http://localhost:8888``):

source: It will then open your default web browser to this URL.
pt_br: Ele irá então abrir no seu navegador padrão nesta URL.

source: When the notebook opens in your browser, you will see the :term:`Notebook Dashboard`, which will show a list of the notebooks, files, and subdirectories in the directory where the notebook server was started. Most of the time, you will wish to start a notebook server in the highest level directory containing notebooks. Often this will be your home directory.
pt_br: Quando o notebook abrir no seu navegador, você verá o :term:`Dashboard do Notebook`, o qual irá exibir uma lista dos notebooks, arquivos e subdiretórios no diretório onde o servidor do notebook foi inicializado. Na maioria das vezes, você irá querer que o servidor do notebook inicie no diretório de nível mais alto que contenha os notebooks. Geralmente este será seu diretório home.

source: **Notebook Dashboard**
pt_br: **Dashboard do Notebook**

source: Introducing the Notebook Server's Command Line Options
pt_br: Introduzindo as Opções de Linha de Comando do Servidor do Notebook

source: How do I open a specific Notebook?
pt_br: Como eu inicio um Notebook específico?

source: The following code should open the given notebook in the currently running notebook server, starting one if necessary.
pt_br: O código seguinte deverá abrir o respectivo notebook no servidor que estiver sendo executado ou iniciando um, se necessário.

source: How do I start the Notebook using a custom IP or port?
pt_br: Como eu inicio o notebook utilizando um IP padrão ou porta?

source: By default, the notebook server starts on port 8888. If port 8888 is unavailable or in use, the notebook server searches the next available port. You may also specify a port manually. In this example, we set the server's port to 9999:
pt_br: Por padrão, o servidor do notebook inicializa na porta 8888. Se a porta 8888 está indisponível ou em uso, o servidor do notebook busca a próxima porta disponível. Você pode também especificar uma porta manualmente. Neste exemplo, nós configuramos a porta do servidor para 9999:

source: How do I start the Notebook server without opening a browser?
pt_br: Como eu inicio o servidor do Notebook sem abrir o navegador?

source: Start notebook server without opening a web browser:
pt_br: Inicializando o servidor do notebook sem abrir o navegador:

source: How do I get help about Notebook server options?
pt_br: Como consigo ajuda sobre as opções do servidor do Notebook?

source: The notebook server provides help messages for other command line arguments using the ``--help`` flag:
pt_br: O servidor do notebook disponibiliza mensagens de ajuda para outros argumentos de linha de comando utilizando a flag ``--help``:

source: :ref:`Jupyter Installation, Configuration, and Usage <content-projects>`
pt_br: :ref:`Instalação, Configuração e Uso do Jupyter <content-projects>`

source: Detailed information about command line arguments, configuration, and usage.
pt_br: Informações detalhadas sobre linhas de comando, argumentos, configuração e uso.
